-- 1) WALLET 테이블 데이터(자식)부터 삭제
DELETE FROM WALLET
WHERE id IN (
             101, 102, 103, 104, 105,
             106, 107, 108, 109, 110,
             111, 112, 113, 114, 115,
             116, 117, 118, 119, 120,
             121, 122, 123, 124, 125,
             126, 127, 128, 129, 130
    );

-- 2) USER 테이블 데이터(부모) 삭제
DELETE FROM USER
WHERE id IN (
             101, 102, 103, 104, 105,
             106, 107, 108, 109, 110,
             111, 112, 113, 114, 115,
             116, 117, 118, 119, 120,
             121, 122, 123, 124, 125,
             126, 127, 128, 129, 130
    );

-- 3) COUPON_INVENTORY 테이블(자식) 데이터 삭제
DELETE FROM COUPON_INVENTORY
WHERE id = 101;

-- 4) COUPON 테이블(부모) 데이터 삭제
DELETE FROM COUPON
WHERE id = 101;
